CSI API ETABS v1

# cSapModelAreaElm Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cAreaElm AreaElm { get; }

    ReadOnly Property AreaElm As cAreaElm
    	Get

    Dim instance As cSapModel
    Dim value As cAreaElm

    value = instance.AreaElm

    property cAreaElm^ AreaElm {
    	cAreaElm^ get ();
    }

    abstract AreaElm : cAreaElm with get

#### Property Value

Type: cAreaElm

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com